PKS1C/src/Catalogs/Клиенты/Клиенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Клиенты</name>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Представитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактныеЛица</name>
    <attributes>
      <name>КонтактноеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

PKS1C/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <basedOn>Document.Встреча</basedOn>
  <basedOn>Document.ТелефонныйЗвонок</basedOn>
  <basedOn>Document.ЭлектронноеПисьмоВходящее</basedOn>
  <basedOn>Document.ЭлектронноеПисьмоИсходящее</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ДатаРождения</name>
    <comment>Дата рождения</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <comment>Пол</comment>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <type>
      <types>CatalogRef.ГруппыДоступаФизическихЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>Уточнение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоКонтактноеЛицо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

PKS1C/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ДокументРегистрацияККТ</name>
      <description>Контактная информация документа &quot;Регистрация ККТ&quot;</description>
    </items>
    <items>
      <name>СправочникКонтактныеЛицаПартнеров</name>
      <description>Контактная информация справочника &quot;Контактные лица партнеров&quot;</description>
    </items>
    <items>
      <name>СправочникКонтрагенты</name>
      <description>Контактная информация справочника &quot;Контрагенты&quot;</description>
    </items>
    <items>
      <name>СправочникОрганизации</name>
      <description>Контактная информация справочника &quot;Организации&quot;</description>
    </items>
    <items>
      <name>СправочникПартнеры</name>
      <description>Контактная информация справочника &quot;Партнеры&quot;</description>
    </items>
    <items>
      <name>СправочникПользователи</name>
      <description>Контактная информация справочника &quot;Пользователи&quot;</description>
    </items>
    <items>
      <name>СправочникРегистрацииВНалоговомОргане</name>
      <description>Контактная информация справочника &quot;Регистрации в налоговом органе&quot;</description>
    </items>
    <items>
      <name>СправочникСклады</name>
      <description>Контактная информация справочника &quot;Склады&quot;</description>
    </items>
    <items>
      <name>СправочникТорговыеТочки</name>
      <description>Контактная информация справочника &quot;Торговые точки&quot;</description>
    </items>
    <items>
      <name>СправочникФизическиеЛица</name>
      <description>Контактная информация справочника &quot;Физические лица&quot;</description>
    </items>
  </predefined>
  <attributes>
    <name>ТолькоНациональныйАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоляДругое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРедактированиеПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПоФИАС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводНесколькихЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактированиеТолькоВДиалоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонCДобавочнымНомером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьМногострочноеПоле</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьОКТМО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МеждународныйФорматАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоВида</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

PKS1C/src/Catalogs/Клиенты/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ЗаполнениеДанныехКонтактныхЛиц()
	Для Каждого КонтактноеЛицоСтрока Из Объект.КонтактныеЛица Цикл
		Элементы.СтраницаКонтакты.ПодчиненныеЭлементы.КонтактныеЛица.ТекущаяСтрока = КонтактноеЛицоСтрока.ПолучитьИдентификатор();
		ТекущиеДанные = Элементы.СтраницаКонтакты.ПодчиненныеЭлементы.КонтактныеЛица.ТекущиеДанные;
		ЗаполнитьДанныеСтрокиКондактногоЛица(ТекущиеДанные);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеСтрокиКондактногоЛица(ТекущиеДанные)
	КонтактноеЛицо = ТекущиеДанные.КонтактноеЛицо;
	ТекущиеДанные.Телефон = ПолучитьНомерТелефонаКонтактногоЛица(КонтактноеЛицо);
	ТекущиеДанные.ЭлектроннаяПочта = ПолучитьЭлектроннуюПочтуКонтактногоЛица(КонтактноеЛицо);
КонецПроцедуры

&НаКлиенте
Процедура КонтактныеЛицаКонтактноеЛицоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.СтраницаКонтакты.ПодчиненныеЭлементы.КонтактныеЛица.ТекущиеДанные;
	ЗаполнитьДанныеСтрокиКондактногоЛица(ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнениеДанныехКонтактныхЛиц();
КонецПроцедуры


&НаКлиенте
Процедура НаименованиеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Объект.ПолноеНаименование = Текст;
	Объект.Наименование = Текст
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНомерТелефонаКонтактногоЛица(КонтактноеЛицо)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ФизическиеЛицаКонтактнаяИнформация.Представление КАК НомерТелефона
		|ИЗ
		|	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
		|ГДЕ
		|	ФизическиеЛицаКонтактнаяИнформация.Тип = &Тип
		|	И ФизическиеЛицаКонтактнаяИнформация.Вид = &Вид
		|	И ФизическиеЛицаКонтактнаяИнформация.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Тип", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Телефон"));
	Запрос.УстановитьПараметр("Ссылка", КонтактноеЛицо);
	Запрос.УстановитьПараметр("Вид", ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НомерТелефона = "";
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		НомерТелефона = ВыборкаДетальныеЗаписи.НомерТелефона;		
	КонецЕсли;
	
	Возврат НомерТелефона;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЭлектроннуюПочтуКонтактногоЛица(КонтактноеЛицо)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ФизическиеЛицаКонтактнаяИнформация.Представление КАК ЭлектроннаяПочта
		|ИЗ
		|	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
		|ГДЕ
		|	ФизическиеЛицаКонтактнаяИнформация.Тип = &Тип
		|	И ФизическиеЛицаКонтактнаяИнформация.Вид = &Вид
		|	И ФизическиеЛицаКонтактнаяИнформация.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Тип", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты"));
	Запрос.УстановитьПараметр("Ссылка", КонтактноеЛицо);
	Запрос.УстановитьПараметр("Вид", ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.EMailФизическиеЛица"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ЭлектроннаяПочта = "";
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЭлектроннаяПочта = ВыборкаДетальныеЗаписи.ЭлектроннаяПочта;		
	КонецЕсли;
	
	Возврат ЭлектроннаяПочта;
КонецФункции
